Проект модуля #3
# Дашборд конверсий
Аналитик данных

# Шаг 1
## Подготовка к работе с данными

Загрузите данные по рекламам из csv

In [1]:
%%time
import pandas as pd
import requests

CPU times: user 1.72 s, sys: 194 ms, total: 1.92 s
Wall time: 305 ms

In [4]:
%%time
from io import StringIO

response = requests.get('https://drive.google.com/uc?id=1pwrFxZKf-fNiFwv8DIzt5bNhlzcxvmcz')
csv_data = StringIO(response.text)

df_ads = pd.read_csv(csv_data)

df_ads.head()

CPU times: user 112 ms, sys: 6.76 ms, total: 119 ms
Wall time: 909 ms

                  date utm_source utm_medium              utm_campaign  cost
0  2023-03-01T09:16:57     google        cpc  virtual_reality_workshop   238
1  2023-03-02T12:48:25     google        cpc  virtual_reality_workshop   164
2  2023-03-03T13:39:30     google        cpc  virtual_reality_workshop   240
3  2023-03-04T16:42:54     google        cpc  virtual_reality_workshop   167
4  2023-03-05T03:58:19     google        cpc  virtual_reality_workshop   268

Изучите данные, сделайте предварительный анализ с помощью dataframe.describe

In [8]:
df_ads.describe(include='all')

,date,utm_source,utm_medium,utm_campaign,cost
count,180,180,180,180,180.000000
unique,180,4,2,5,NaN
top,2023-03-01T09:16:57,yandex,cpc,cybersecurity_special,NaN
freq,1,79,115,43,NaN
mean,NaN,NaN,NaN,NaN,192.533333
std,NaN,NaN,NaN,NaN,57.017335
min,NaN,NaN,NaN,NaN,100.000000
25%,NaN,NaN,NaN,NaN,143.750000
50%,NaN,NaN,NaN,NaN,181.500000
75%,NaN,NaN,NaN,NaN,241.250000
max,NaN,NaN,NaN,NaN,300.000000

Визиты из CSV

In [9]:
df_visits_csv = pd.read_csv("https://drive.google.com/uc?id=1QosQQ4RRNR9rkL4t7sB707h2Uy0XfYJe")

df_visits_csv.head()

,uuid,platform,user_agent,date
0,1de9ea66-70d3-4a1f-8735-df5ef7697fb9,web,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_2...,2023-03-01T13:29:22
1,f149f542-e935-4870-9734-6b4501eaf614,web,Mozilla/5.0 (X11; CrOS x86_64 8172.45.0) Apple...,2023-03-01T16:44:28
2,f149f542-e935-4870-9734-6b4501eaf614,web,Mozilla/5.0 (X11; CrOS x86_64 8172.45.0) Apple...,2023-03-06T06:12:36
3,08f0ebd4-950c-4dd9-8e97-b5bdf073eed1,web,Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:109...,2023-03-01T20:16:37
4,08f0ebd4-950c-4dd9-8e97-b5bdf073eed1,web,Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:109...,2023-03-05T17:42:47

In [10]:
df_visits_csv.describe(include='all')

,uuid,platform,user_agent,date
count,1000,1000,1000,1000
unique,519,3,28,996
top,251a0926-ece3-4d77-aa42-ab569fdf9fe2,web,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,2023-03-01T08:01:45
freq,4,954,71,2

Регистрации из CSV

In [11]:
df_registrations_csv = pd.read_csv("https://drive.google.com/uc?id=1AeQz0kaSgz0lxYSDtuNm36muhy5fRCzZ")

df_registrations_csv.head()

,date,user_id,email,platform,registration_type
0,2023-03-01T00:25:39,8838849,joseph95@example.org,web,google
1,2023-03-01T14:53:01,8741065,janetsuarez@example.net,web,yandex
2,2023-03-01T14:27:36,1866654,robert67@example.org,web,google
3,2023-03-01T02:42:34,1577584,elam@example.net,web,apple
4,2023-03-01T10:27:14,4765395,stephanie68@example.net,web,yandex

In [12]:
df_registrations_csv.describe(include='all')

,date,user_id,email,platform,registration_type
count,1000,1.000000e+03,1000,1000,1000
unique,1000,NaN,997,3,4
top,2023-03-01T00:25:39,NaN,zanderson@example.org,android,email
freq,1,NaN,2,517,446
mean,NaN,4.488623e+06,NaN,NaN,NaN
std,NaN,2.620568e+06,NaN,NaN,NaN
min,NaN,2.236800e+04,NaN,NaN,NaN
25%,NaN,2.235489e+06,NaN,NaN,NaN
50%,NaN,4.473044e+06,NaN,NaN,NaN
75%,NaN,6.779707e+06,NaN,NaN,NaN
max,NaN,8.881772e+06,NaN,NaN,NaN

# Шаг 2
## Запросы к API
Запросите данные по API за период 2023-03-01 -> 2023-09-01

Визиты

In [36]:
START = "2023-03-01"
END = "2023-09-01"

In [14]:
%%time

response = requests.get(f"https://data-charts-api.hexlet.app/visits?begin={START}&end={END}")

data = response.json()

df_visits = pd.DataFrame(data)

df_visits.head()

CPU times: user 623 ms, sys: 173 ms, total: 796 ms
Wall time: 6.23 s

,datetime,platform,user_agent,visit_id
0,"Wed, 01 Mar 2023 23:17:37 GMT",web,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,1de9ea66-70d3-4a1f-8735-df5ef7697fb9
1,"Sat, 04 Mar 2023 03:23:34 GMT",web,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,1de9ea66-70d3-4a1f-8735-df5ef7697fb9
2,"Wed, 01 Mar 2023 12:57:13 GMT",web,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,f149f542-e935-4870-9734-6b4501eaf614
3,"Wed, 01 Mar 2023 13:07:19 GMT",web,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7...,08f0ebd4-950c-4dd9-8e97-b5bdf073eed1
4,"Sun, 05 Mar 2023 22:02:39 GMT",web,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7...,08f0ebd4-950c-4dd9-8e97-b5bdf073eed1

In [15]:
df_visits.describe(include='all')

,datetime,platform,user_agent,visit_id
count,308871,308871,308871,308871
unique,303530,4,32,170101
top,"Tue, 14 Mar 2023 13:31:26 GMT",web,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,5f260cd8-3c51-41fe-a394-8f5213d58793
freq,4,278078,15679,4

Регистрации

In [16]:
%%time

response = requests.get(f"https://data-charts-api.hexlet.app/registrations?begin={START}&end={END}")

data = response.json()

df_registrations = pd.DataFrame(data)

df_registrations.head()

CPU times: user 149 ms, sys: 18.9 ms, total: 167 ms
Wall time: 889 ms

,datetime,email,platform,registration_type,user_id
0,"Wed, 01 Mar 2023 13:21:20 GMT",jlane@example.net,web,google,8dd9b457-f02e-4cff-a66a-d70838849f04
1,"Wed, 01 Mar 2023 01:14:06 GMT",dyerkenneth@example.net,web,yandex,52e2b626-c6fa-4919-a67d-09adb33accdc
2,"Wed, 01 Mar 2023 19:47:32 GMT",kwade@example.com,web,yandex,bab974bd-2176-4497-acb2-4bc61ca93f5c
3,"Wed, 01 Mar 2023 19:19:26 GMT",fisherbrian@example.net,web,email,b517892a-15c0-4320-9f33-e65db1110395
4,"Wed, 01 Mar 2023 02:30:54 GMT",johngomez@example.org,web,google,bd38427f-7120-4c14-a384-889a2335108b

In [18]:
%%time

df_registrations.describe(include='all')

CPU times: user 35.2 ms, sys: 3.56 ms, total: 38.8 ms
Wall time: 38 ms

,datetime,email,platform,registration_type,user_id
count,28197,28197,28197,28197,28197
unique,28143,26707,3,4,28197
top,"Tue, 14 Mar 2023 18:21:50 GMT",yjones@example.net,android,email,8dd9b457-f02e-4cff-a66a-d70838849f04
freq,2,6,13760,11977,1

# Шаг 3

## Расчет метрик

Сгруппируйте данные визитов по датам и платформам

In [47]:
%%time

response = requests.get(f"https://data-charts-api.hexlet.app/visits?begin={START}&end={END}")
data = response.json()

df_visits = pd.DataFrame(data)

df_visits['datetime'] = pd.to_datetime(df_visits['datetime'])

idx = df_visits.groupby('visit_id')['datetime'].idxmax()

df_filtered_visits = df_visits.loc[idx]

df_filtered_visits = df_filtered_visits[~df_filtered_visits['user_agent'].str.contains('bot', case=False)]

df_filtered_visits['datetime'] = df_filtered_visits['datetime'].dt.strftime('%Y-%m-%d')

df_grouped = df_filtered_visits.groupby(['datetime', 'platform']).size().reset_index(name='visits')

df_grouped.columns = ['date_group', 'platform', 'visits']

df_visit_grouped = df_grouped.sort_values(by='date_group')

df_visit_grouped.head()

CPU times: user 4.14 s, sys: 140 ms, total: 4.28 s
Wall time: 11.7 s

   date_group platform  visits
0  2023-03-01  android     264
1  2023-03-01      ios      78
2  2023-03-01      web     333
3  2023-03-02  android     106
4  2023-03-02      ios     103

In [46]:
df_visit_grouped.describe(include='all')

        date_group platform       visits
count          552      552   552.000000
unique         184        3          NaN
top     2023-03-01  android          NaN
freq             3      184          NaN
mean           NaN      NaN   295.528986
std            NaN      NaN   524.904616
min            NaN      NaN     1.000000
25%            NaN      NaN    28.000000
50%            NaN      NaN    73.500000
75%            NaN      NaN   397.500000
max            NaN      NaN  3583.000000

Сгруппируйте также данные регистраций по датам и платформам

In [59]:
%%time
response = requests.get(f"https://data-charts-api.hexlet.app/registrations?begin={START}&end={END}")
data = response.json()

df_registrations = pd.DataFrame(data)

df_registrations['date_group'] = pd.to_datetime(df_registrations['datetime']).dt.strftime('%Y-%m-%d')

df_grouped = df_registrations.groupby(['date_group', 'platform']).size().reset_index(name='registrations')

df_registrations_grouped = df_grouped.sort_values(by=['date_group'])

df_registrations_grouped.head()

CPU times: user 218 ms, sys: 17.9 ms, total: 236 ms
Wall time: 1.08 s

   date_group platform  registrations
0  2023-03-01  android            218
1  2023-03-01      ios             67
2  2023-03-01      web             78
3  2023-03-02  android             91
4  2023-03-02      ios             76

In [60]:
df_registrations_grouped.describe(include='all')

        date_group platform  registrations
count          552      552     552.000000
unique         184        3            NaN
top     2023-03-01  android            NaN
freq             3      184            NaN
mean           NaN      NaN      51.081522
std            NaN      NaN      58.226127
min            NaN      NaN       1.000000
25%            NaN      NaN      17.000000
50%            NaN      NaN      31.000000
75%            NaN      NaN      63.000000
max            NaN      NaN     338.000000

Объедините датайфреймы, сделайте итоговый датафрейм с расчетом конверсии

Сохраните датафрейм в формате JSON conversion.json

In [68]:
%%time
result_df = pd.merge(df_visit_grouped, df_registrations_grouped, on=['date_group', 'platform'], how='outer')

result_df['conversion'] = (result_df['registrations'] / result_df['visits']) * 100

result_df['conversion'] = result_df['conversion'].round(2)

df_conversion = result_df.sort_values(by='date_group')

df_conversion.to_json('conversion.json', orient='records')

df_conversion.head()

CPU times: user 7.73 ms, sys: 3.13 ms, total: 10.9 ms
Wall time: 8.64 ms

   date_group platform  visits  registrations  conversion
0  2023-03-01  android     264            218       82.58
1  2023-03-01      ios      78             67       85.90
2  2023-03-01      web     333             78       23.42
3  2023-03-02  android     106             91       85.85
4  2023-03-02      ios     103             76       73.79

In [67]:
df_conversion.describe(include='all')

        date_group platform       visits  registrations  conversion
count          552      552   552.000000     552.000000  552.000000
unique         184        3          NaN            NaN         NaN
top     2023-03-01  android          NaN            NaN         NaN
freq             3      184          NaN            NaN         NaN
mean           NaN      NaN   295.528986      51.081522   57.650815
std            NaN      NaN   524.904616      58.226127   38.173042
min            NaN      NaN     1.000000       1.000000    1.090000
25%            NaN      NaN    28.000000      17.000000    7.935000
50%            NaN      NaN    73.500000      31.000000   76.330000
75%            NaN      NaN   397.500000      63.000000   84.850000
max            NaN      NaN  3583.000000     338.000000  180.000000